Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkTagAttributes Class
 The SectionMarkTagAttributes class contains attributes for section mark tags.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.ViewMarkBasicTagAttributes
 Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class SectionMarkTagAttributes : ViewMarkBasicTagAttributes
<SerializableAttribute>
Public NotInheritable Class SectionMarkTagAttributes
	Inherits ViewMarkBasicTagAttributes
The SectionMarkBase.SectionMarkTagAttributes type exposes the following members.
Constructors
Name | Description
SectionMarkBase.SectionMarkTagAttributes()
 Creates a new section mark tag attributes instance.
SectionMarkBase.SectionMarkTagAttributes(SectionMarkBase.SectionMarkTagAttributes.TagShowOnSide, TagLocation, Vector, SectionMarkBase.SectionMarkTagAttributes.TagTextRotation, ContainerElement)
 Creates a new section mark tag attributes instance with the given information.
Top
Properties
Name | Description
Location
 The location of the mark tag.
 (Inherited from ViewMarkBasicTagAttributes.)
Offset
 The offset of the mark tag.
 (Inherited from ViewMarkBasicTagAttributes.)
ShowOnSide
 The side(s) on which the tag is shown.
TagContent
 The tag content.
 (Inherited from ViewMarkBasicTagAttributes.)
TagRotation
 The policy for the tag rotation.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ViewMarkBasicTagAttributes.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace